'use client'
import { Divider } from "@heroui/react"

export default function TermsClient() {
    return (
        <div className="min-h-[calc(100vh-65px)] p-5 w-full max-w-[1280px] mx-auto">
            <h1 className="text-3xl font-bold mt-4 mb-12">로츠고(LOT'S GO) 이용약관</h1>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 1 조 목적</h2>
            <Divider/>
            <p className="mt-2">
                이 약관은 로츠고 - Lot's go(이하 "회사")가 운영하는 사이트에서 제공하는 "서비스"의 이용과 관련하여 "회사"와 "이용자", "회원" 간의 이용조건, 제반 절차, 의무 및 책임 사항, 기타 필요한 사항을 규정함을 목적으로 한다.
            </p>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 2 조 정의</h2>
            <Divider/>
            <p className="mt-2">본 약관에서 사용하는 용어의 정의는 다음과 같다.</p>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    "사이트"라 함은 "회사"가 "이용자" 또는 "회원"에게 서비스를 제공하기 위해 단말기(PC, TV, 휴대형 단말기 등의 각종 유·무선 장치를 포함) 등 정보 통신 설비를 이용하여 "회사"가 "이용자", "회원"에게 "서비스"를 제공하는 가상의 영업장을 말하며, "회사"가 운영하는 웹사이트인 www.lotsgo.kr 등이 이에 포함된다.
                </li>
                <li>
                    "서비스"란 "회사"의 "사이트"에서 "이용자" 또는 "회원"에게 유·무료로 제공하는 모든 서비스를 말한다. 로스트아크 공지사항, 이벤트, 전투정보실과 숙제 관리, 일정 관리 등을 의미한다.
                </li>
                <li>
                    "이용자"란 "서비스"를 이용하기 위해 들어오는 사람을 말한다.
                </li>
                <li>
                    "회원"란 "회사"의 약관에 동의하여 "회사"와 이용 계약을 체결한 회원을 말한다.
                </li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 3 조 약관의 게시 및 개정</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    "회사"는 이 약관의 내용을 쉽게 확인할 수 있도록 사이트의 초기 화면에 게시한다.
                    다만, 약관의 내용은 "이용자" 또는 "회원"이 연결화면을 통하여 볼 수 있도록 할 수 있다.
                </li>
                <li>
                    "회사"는 약관의 규제에 관한 법률, 전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보 보호 등에 관한 법률 등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있다.
                </li>
                <li>
                    "회사"가 약관을 개정할 경우에는 개정 약관 적용일 최소 7일 전부터 "사이트" 내 초기화면 및 연결화면 등을 통해 게시한다.
                    다만, 약관의 변경으로 인해 소비자의 권리, 의무에 중대한 영향을 줄 경우에는 그 적용일 30일 전까지 본문과 같은 방법으로 공지하고 이메일 발송 등의 방법으로 "회원"에게 통지한다.
                </li>
                <li>
                    "회원"은 변경된 약관에 대해 거부할 권리가 있다. 
                    "회원"은 변경된 약관이 공지된 지 15일 이내에 거부 의사를 표명할 수 있다.
                    "회원"이 거부하는 경우 본 "서비스" 제공자인 "회사"는 15일의 기간을 정하여 "회원"에게 사전 통지 후 당해 "회원"과의 계약을 해지할 수 있다.
                    만약, "회원"이 15일 이내에 거부 의사를 표시하지 않고 "서비스"를 계속 이용하는 경우에는 동의하는 것으로 간주한다.
                </li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 4 조 약관 외 준칙</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    이 약관에서 규정하지 않은 사항에 관해서는 약관의 규제 등의 관한 법률, 전기통신기본법, 전기통신사업법, 정보통신망 이용 촉진 및 정보 보호 등에 관한 법률 등의 관계법령에 따른다.
                </li>
                <li>
                    각 "사이트" 및 "서비스" 이용약관이 별도로 있는 경우에는 해당 "사이트" 및 "서비스" 이용약관이 본 약관에 우선한다.
                </li>
                <li>
                    "회원"이 "회사"와 개별 계약을 체결하여 "서비스"를 이용할 경우에는 개별 계약이 본 약관에 우선한다.
                </li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 5 조 이용계약의 성립</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    "회사"의 "서비스" 이용계약(이하 "이용계약"이라 한다)은 "서비스"를 이용하고자 하는 자가 본 약관과 개인정보 수집, 이용 및 제공 내용 등의 내용에 대한 동의함으로써 성립한다.
                </li>
                <li>
                    "서비스"를 이용하고자 하는 자가 이용 신청 당시 웹상의 "개인정보 동의"를 체크하면 본 약관 및 개인정보 수집, 이용 및 제공 내용 등에 대하여 동의한 것으로 간주한다.
                </li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 6 조 서비스 이용 신청</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    "회원"으로 가입하여 본 "서비스"를 이용하고자 하면 본 약관 외 개인정보 수집, 이용 및 제공 내용 등에서 정한 필수 수집항목 등을 제공하여야 한다.
                </li>
                <li>
                    모든 "회원"은 유료 서비스 이용 시에는 유료 서비스에 기재되어 있는 항목에 동의하여야 이용할 수 있다.
                </li>
                <li>
                    "회원"이 입력 정보를 허위로 기재할 경우에는 이용정지, 재가입 불가, 손해배상청구 등 불이익이 부과될 수 있다.
                </li>
                <li>
                    "회사"는 타인의 명의를 도용하여 이용 신청을 한 "회원"의 모든 정보를 삭제 조치하고, 관계법령에 따라 처벌을 요구할 수 있다.
                </li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 7 조 이용 신청의 제한 및 주의사항</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    "회사"는 전조의 규정에 의한 이용 신청 고객에 대하여 업무 수행상 또는 기술상 지장이 없는 경우에는 원칙적으로 접수 순서에 따라 "서비스" 이용을 승낙한다.
                </li>
                <li>
                    "회사"는 아래 사항에 해당하는 경우에 대해서는 이용 신청을 제한한다.
                </li>
                <ol className="list-decimal pl-4">
                    <li>본인의 명의가 아닌 타인의 명의를 가진 게임 캐릭터를 이용하여 신청한 경우</li>
                    <li>같은 원정대로 여러 개의 계정을 생성한 경우</li>
                    <li>그 외 기타 제반 사항 위반 등 신청자의 귀책 사유가 있는 경우</li>
                </ol>
                <li>
                    "회사"는 아래 사항에 해당하는 경우에는 그 신청에 대하여 승낙 제한 사유가 해소될 때까지 승낙을 유보할 수 있다. 다만, 이러한 경우에는 그 사유를 고지하여야 한다.
                </li>
                <ol className="list-decimal pl-4">
                    <li>회사가 설비의 여유가 없는 경우</li>
                    <li>회사의 기술상 지장이 있는 경우</li>
                    <li>기타 회사가 합리적인 판단에 의하여 필요하다고 인정하는 경우</li>
                </ol>
                <li>이용 신청 주의사항</li>
                <ol className="list-decimal pl-4">
                    <li>이메일을 작성할 경우 존재하지 않는 이메일로 작성할 경우 이후 비밀번호 찾는 경우 문제가 생길 수 있다.</li>
                </ol>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 8 조 회원 정보의 변경</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>"회원"은 "회사"의 정보 수정 페이지에서 언제든지 일부 자신의 개인정보를 열람하고 수정할 수 있다.</li>
                <li>"회사"는 "회원"이 "회원"의 정보를 수정하지 않아 발생한 불이익에 대한 책임을 지지 않는다.</li>
                <li>"회사"는 안정적인 서비스를 제공하기 위해 테스트 및 모니터링 용도에 한하여 회원의 정보를 열람할 수 있다.</li>
                <li>"회원"이 탈퇴하는 순간부터 "회사"는 "회원"의 정보를 이용할 수 없다.</li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 9 조 회원의 이용 계약 해지 · 해제 등</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    "회원"이 계약을 해지할 경우, 관련 법 및 개인정보 처리방침에 따라 정보는 해지 즉시 소멸된다.
                </li>
                <li>
                    "회원"의 정보가 삭제된 후에는 기존 정보를 복구할 수 없다.
                </li>
                <li>
                    "회원"이 다음 각 호의 사유에 해당하는 경우 "회사"는 사전 동의 없이 가입 해지나 "서비스" 중지, 데이터 삭제 조치를 취할 수 있다.
                </li>
                <ol className="list-decimal pl-4">
                    <li>본 약관상 "회원"의 의무를 성실하게 이행하지 않았을 경우</li>
                    <li>"회원"이 등록한 정보의 내용이 사실과 다르거나 조작되었을 경우</li>
                    <li>정당한 사유없이 유·무료 서비스를 반복적으로 신청하고 취소하여 회사에 손해를 입히거나 회사의 업무에 지장을 주는 경우</li>
                    <li>"회사"의 저작권 또는 제3자의 저작권 등 기타 권리를 침해하는 내용을 게시한 경우</li>
                    <li>제3자를 비방하거나 중상모략으로 명예를 손상시키는 내용을 게시하는 등 피해를 주는 경우</li>
                    <li>공공질서 및 미풍양속에 위반되는 내용을 게시한 경우</li>
                    <li>"사이트"의 콘텐츠, 정보, UI 등에 대한 무단 복제, 전송, 베포, 크롤링, 스크래핑 등의 행위를 한 경우</li>
                    <li>기타 관계 법규에 위배되는 내용이거나 사이트의 원활한 운영을 위하여 운영자가 필요하다고 판단한 경우</li>
                </ol>
                <li>
                    "회사"는 "주민등록법"을 위반한 명의도용 및 결제도용, "저작권법" 및 "컴퓨터프로그램보호법"을 위반한 불법프로그램의 제공 및 운영방해, "정보통신망법"을 위반한 불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을 위반한 경우에는 즉시 영구이용정지를 할 수 있다.
                </li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 10 조 서비스의 내용</h2>
            <Divider/>
            <p className="mt-2">
                "회사"가 필요한 경우 "서비스"의 내용을 추가 또는 변경할 수 있다. 
                다만, 이 경우 "회사"는 "회원"의 권리 또는 의무에 영향을 주는 경우 추가 또는 변경된 내용을 "회원"에게 공지해야 한다.
            </p>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 11 조 서비스 이용 시간</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    "회사"는 특별한 사유가 없는 한 연중무휴, 1일 24시간 "서비스"를 제공한다. 
                    다만, "회사"는 "서비스"의 종류나 성질에 따라 제공하는 "서비스" 중 일부에 대해서는 별도로 이용시간을 정할 수 있으며, 이 경우 "회사"는 그 이용 시간을 사전에 "회원"에게 공지 또는 통지하여야 한다.
                </li>
                <li>
                    "회사"는 자료의 가공과 갱신을 위한 시스템 작업시간, 장애 해결을 위한 보수작업 시간, 시스템 교체 작업, 회선 장애 등이 발생한 경우 일시적으로 "서비스"를 중단할 수 있으며 계획된 작업의 경우 공지란에 "서비스" 중단 시간과 작업 내용을 알려야 한다. 다만, "회사"가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있다.
                </li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 12 조 서비스 제공의 중지</h2>
            <Divider/>
            <p className="mt-2">"회사"는 다음 각 호에 해당하는 경우 "서비스"의 제공을 중지할 수 있다.</p>
            <ul className="list-disc pl-8">
                <li>설비의 보수 등 회사의 필요에 의해 사전에 "회원"에게 통지한 경우</li>
                <li>기간통신사업자가 전기통신서비스 제공을 중지하는 경우</li>
                <li>기타 불가항력적인 사유에 의해 서비스 제공이 객관적으로 불가능한 경우</li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 13 조 회사의 의무</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    "회사"는 본 약관에서 정한 바에 따라 계속적, 안정적으로 "서비스"를 제공할 수 있도록 최선의 노력을 다해야 한다.
                </li>
                <li>
                    "회사"는 "서비스"와 관련한 회원의 불만사항이 접수되는 경우 이를 지체없이 처리하도록 노력하여야 하며, 즉시 처리가 곤란한 경우에는 그 사유와 처리 일정을 "서비스" 화면 또는 기타 방법 등을 통해 동 "회원"에게 통지하여야 한다.
                </li>
                <li>
                    "회사"는 유료 서비스와 관련한 정보는 5년 이상 보존한다.
                </li>
                <li>
                    천재지변 등 예측하기 못한 일이 발생하거나 시스템의 장애가 발생하여 "서비스"가 중단될 경우 이에 대한 손해에 대해서는 "회사"가 책임을 지지 않는다. 
                    다만, 자료의 복구나 정상적인 "서비스" 지원이 되도록 최선을 다할 의무를 진다.
                </li>
                <li>
                    "회원"의 자료를 본 "서비스" 이외의 목적으로 제3자에게 제공하거나 열람하게 할 경우에는 반드시 "회원"의 동의를 얻어야 한다.
                </li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 13 조 회원 및 이용자의 의무</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    "회원" 및 "이용자"는 관계법령에 따라 본 약관의 규정 및 기타 "회사"가 통지하는 사항을 준수하여야 되며, 기타 "회사"의 업무에 방해되는 행위를 해서는 안 된다.
                </li>
                <li>
                    ""회원" 및 "이용자"는 본 "서비스"를 이용 중 다음 각 호의 행위를 해서는 안 된다.
                </li>
                <ol className="list-decimal pl-4">
                    <li>"회원"의 정보를 타인 및 타사에 양도, 증여, 대여하거나 사용하도록 하는 행위</li>
                    <li>다른 "회원"의 정보를 도용, 사칭 등 부정 사용하는 행위</li>
                    <li>범죄행위를 목적으로 하거나 기타 범죄행위와 관련된 행위</li>
                    <li>"회사" 및 타인의 명예를 훼손하거나 모욕하는 행위</li>
                    <li>"회사" 및 타인의 지식재산권 등의 권리를 침해하는 행위(특히 "서비스"를 이용하면서 취득한 다른 업체의 정보 등을 유포하는 행위)</li>
                    <li>해킹 행위 또는 바이러스의 유포 행위</li>
                    <li>타인의 의사에 반하여 광고성 정보 등 일정한 내용을 계속적으로 전공하는 행위</li>
                    <li>서비스의 안정적인 운영에 지장을 주거나 줄 우려가 있다고 판단되는 행위</li>
                    <li>사이트의 정보 및 서비스를 이용한 영리 행위</li>
                    <li>사이트의 콘텐츠, 정보, UI 등에 대한 무단 복제, 전송, 배포, 크롤링, 스크래핑 등의 행위</li>
                    <li>그 밖에 선량한 풍속, 기타 사회질서를 해하거나 관계법령에 위반하는 행위</li>
                </ol>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 14 조 손해배상</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>
                    "회사"가 "회원"에게 이 약관 제10조, 제18조 규정에 위반한 행위로 손해를 입히거나 기타 "회사"가 제공하는 모든 서비스와 관련하여 "회사"의 책임 있는 사유로 인해 이용자에게 손해가 발생한 경우 "회사"는 그 손해를 배상하여야 한다.
                </li>
                <li>
                    회원이 이 약관의 규정에 위반한 행위 또는 "회원"의 책임 있는 사유로 "회사" 및 제3자에게 손해를 입힌 경우에는 "회원"이 그 손해를 배상하여야 한다.
                </li>
                <li>
                    "회사"가 무료로 제공하는 "서비스"의 이용과 관련하여 개인정보 처리방침에서 정하는 내용에 위반하지 않는 한 어떠한 손해도 책임지지 않는다.
                </li>
                <li>
                    "회사"는 천재지변 또는 이에 준하는 불가항력으로 인하여 "서비스"를 제공할 수 없는 경우에는 고의 및 중대한 과실이 없는 한 "서비스" 제공에 관한 책임이 면제된다.
                </li>
                <li>
                    "회사"는 "서비스" 이용과 관련하여 "회원"에게 발생한 손해 가운데, "회원"의 고의, 과실 및 "회원"의 귀책사유로 인한 "서비스" 이용의 장애 및 손해에 대하여는 책임을 지지 않는다.
                </li>
                <li>
                    "회사"는 사용자(회원, 이용자 모두 포함)이 서비스와 관련하여 기재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 고의 또는 과실이 없는 한 이로 인해 발생한 "회원"의 손해에 대하여 책임을 지지 않는다.
                </li>
                <li>
                    타 회원 및 제3자의 귀책사유로 "회원"의 손해가 발생한 경우 "회사"는 이에 대한 배상 책임이 없다.
                </li>
            </ul>
            <h2 className="mt-4 mb-2 text-2xl font-bold">제 15 조 회원의 개인정보 보호</h2>
            <Divider/>
            <p className="mt-2">
                "회사"는 "회원"의 개인정보 보호를 위하여 노력해야 한다.
                "회원"의 개인정보 보호에 관해서는 개인정보 보호법 및 정보통신망 이용촉진 및 정보보호 등에 관한 법 등 관련 법령에 따르고, 사이트에 "개인정보 처리방침"을 고지한다.
            </p>
            <h2 className="mt-4 mb-2 text-2xl font-bold">성매매 알선 및 행위 경고</h2>
            <Divider/>
            <p className="mt-2">
                성매매알선 등 행위의 처벌에 관한 법률 제4조에 위배되는 게시물을 게시할 경우 동법 제19조에 따라 처벌받을 수 있으며, "회사"는 이용자에게 사전 통지 없이 게시물 삭제 및 이용계약을 해지할 수 있다.
            </p>
            <h2 className="mt-4 mb-2 text-2xl font-bold">분쟁의 해결</h2>
            <Divider/>
            <ul className="list-disc pl-4 mt-2">
                <li>"회사"와 "회원"는 "서비스"와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든 노력을 하여야 한다.</li>
                <li>전항의 노력에도 불구하고, "회사"와 "회원" 간에 발생한 전자거래 분쟁에 관한 소송을 소송 제기 당시 "회원"의 주소를 관할하는 지방 법원을 전속 관할법원으로 한다.</li>
            </ul>
            <p className="mt-8">게시일 : 2025년 6월 14일</p>
            <p>적용일 : 2025년 6월 29일</p>
        </div>
    )
}